tutorial/volCoup-oneWay/energySolve/0.orig/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -1 0 0 0 0 ];
oriented	oriented;

internalField   uniform 0;

boundaryField
{
    interface
    {
        type            calculated;
	value		$internalField;
    }
    inlet
    {
        type            calculated;
        value           $internalField;
    }
    outlet
    {
        type            calculated;
        value           $internalField;
    }
    top
    {
        type            calculated;
        value           $internalField;
    }
    bottom
    {
        type            calculated;
        value           $internalField;
    }
    slip-bottom
    {
        type            calculated;
        value           $internalField;
    }
    outerWall
    {
        type            calculated;
        value           $internalField;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
