tutorial/volCoup-oneWay/energySolve/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant energySolve;

modules (AITS);

interfaces
{
  Interface1
  {
    mesh              	energySolve-Mesh-vol;
    locations		volume;
    patches		(inlet outlet top slip-bottom bottom interface defaultFaces);

    readData
    (
	PredVel
	Dpdt
    );
    
    writeData
    (
    );
  };
  Interface2
  {
    mesh                energySolve-Mesh-volSurf;
    locations           volSurf;
    patches		(inlet outlet top slip-bottom bottom interface defaultFaces);

    readData
    (
        Flux
    );

    writeData
    (
    );
  };
};
